[
    {

        "index": 0,
        "title": "Interactive Implementation: Fitlody",
        "content": [
            "Problem statement: Motivation is one of the most limitation of people doing exercises. We want to combined “exercise” with “music creation”",
            "Design Process: Due to the COVID-19, the user research had to be done on an online format. ",
            "Conceptual Design: An exercise area with force sensing resistor located under the floor and inside the equipments and could collect data from the user’s exercising and create music based on the tempo of user doing exercise. ",
            "Prototyping",
            "Evaluation: Online exhibits on discord. "
        ],
        "images":[
            {"index":0,"name":"Fitlody-physical-build-1","src":"fitlody-physbd1.jpg"},
            {"index":1,"name":"Fitlody-physical-build-2","src":"fitlody-physbd2.jpg"},
            {"index":2,"name":"Fitlody-physical-build-3","src":"fitlody-physbd3.jpg"},
            {"index":3,"name":"Fitlody-poster","src":"fitlody-poster.png"},
            {"index":4,"name":"Fitlody-prototype","src":"fitlody-prototype.png"}
        ]
    },

    {
        "index": 1,
        "title": "Web-based Game: Infinite Travel",
        "content": [
            "Problem statement: We have got APIs from Picture Queensland Database containing old pictures of Queensland, how to design an interactive system to introduce these buried treasure to our audience?",
            "Conceptual Design: A retro side-scroller game using “Time Travel“ as context. And whenever the user reach a certain score they will find a “piece in time tunnel” which is a old photo of Queensland.",
            "Prototyping",
            "Evaluation: In campus exhibition at 26 June 2019 and was very popular among the audience. "
        ],
        "images":[
            {"index":0,"name":"infinite-travel-introduction","src":"infitrav-intro.png"},
            {"index":1,"name":"infinite-travel-game","src":"infitrav-game.png"}
        ]
        
    },

    {
        "index": 2,
        "title": "Mobile-App Design: Pillow",
        "content": [
            "Problem statement: Study shows that 70% of the people couldn’t get enough sleep, this situation is even severer among the college students. Our team will study the reasons and factors that cause this phenomenon, and come up with some design to help improve this situation.",
            "Design Process: Insights got from our user indicated that insufficient sleep was caused by multiple reasons. But one important factor is that most of the young people didn’t realise the harm caused by staying up late, there wasn’t an intuitive and visualised impact to motivated them keep a healthy lifecycle.",
            "Conceptual Design: The core spirit of the application is that we allow our user to create their own Avatar. Their unhealthy sleep schedule will reflect on the negative changes on their Avatar. Besides, we also offer functions for our user to collect their own white noise sounds to help their sleep.",
            "Prototyping",
            "Evaluation: Think Aloud Protocol with TAM, System Usability Scale, Heuristic Evaluation."
        ],
        "images":[
            {"index":0,"name":"pillow-ethics","src":"pillow-ethics.png"},
            {"index":1,"name":"pillow-prototype","src":"pillow-prototype.png"},
            {"index":3,"name":"pillow-tam","src":"pillow-tam.png"}
        ]
    },
    
    
    {
        "index": 3,
        "title": "Conceptual Design: Smart Fridge",
        "content": [
            "Problem statement: Share a large fridge with other tenants is a common issues that bothered me during my postgraduate study abroad. Not only does it make it hard to find a certain object from the fridge, but also often make me forget those foods laid deep inside only to find it weeks after expired date. This need to be changed!",
            "Conceptual Design: Magnetic stickers that could contains the information of each food ingredient, with lights showing whether the food is still at good condition. Arrange those stickers so they could helps you to memorise the arrangement inside the fridge!"
        ],
        "images":[
            {"index":0,"name":"pillow-ethics","src":"pillow-ethics.png"},
            {"index":1,"name":"pillow-prototype","src":"pillow-prototype.png"},
            {"index":3,"name":"pillow-tam","src":"pillow-tam.png"}
        ]
    },

    {
        "index": 4,
        "title": "Some Graphic Design Works",
        "content": [
            "Just the Facts",
            "Suburb gone Vintage"
        ],
        "images":[
            {"index":0,"name":"pillow-ethics","src":"graphicdesign-jtf1.png"},
            {"index":1,"name":"pillow-prototype","src":"graphicdesign-jtf2.png"},
            {"index":3,"name":"pillow-tam","src":"graphicdesign-suburb.png"}
        ]
    }


]